# 9. 데이터 선택 (조건)
: 조건에 해당하는 데이터 선택

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [3]:
df['키'] >= 185      # True / False 로 불러옴

지원번호
1번     True
2번    False
3번    False
4번     True
5번     True
6번     True
7번     True
8번     True
Name: 키, dtype: bool

In [5]:
filt = (df['키'] >= 185  )
df[filt]

       이름   학교    키   국어   영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85  Python
4번    서태웅  북산고  187   40   60   70  75  80     NaN
5번    강백호  북산고  188   15   20   10  35  10     NaN
6번    변덕규  능남고  202   80  100   95  85  80       C
7번    황태산  능남고  188   55   65   45  40  35  PYTHON
8번    윤대협  능남고  190  100   85   90  95  95      C#

In [6]:
df[~filt]     # ~ => False 데이터 불러옴

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
2번    정대만  북산고  184  40  35  50  55  25        Java
3번    송태섭  북산고  168  80  75  70  80  75  Javascript

In [11]:
df.loc[df['키'] >= 185  , ['수학','과학']]    # 키 185 이상 학생들의 수학,과학 점수

       수학  과학
지원번호
1번    100  95
4번     70  75
5번     10  35
6번     95  85
7번     45  40
8번     90  95

## 다양한 조건

### And 조건. (&)

In [16]:
df.loc[(df['키'] >= 185)  & (df['학교']== '북산고')]

       이름   학교    키  국어  영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85  Python
4번    서태웅  북산고  187  40  60   70  75  80     NaN
5번    강백호  북산고  188  15  20   10  35  10     NaN

### Or 조건 (|)

In [21]:
df.loc[(df['키'] < 170  ) | (df['키'] > 200  ), ['이름','수학']]
# 키가 170 미만이거나 200 초과인 사람들의 이름 , 수학 정보

       이름  수학
지원번호
3번    송태섭  70
6번    변덕규  95

### str 함수

In [27]:
filt = df['이름'].str.startswith('송')  # '송'씨 성을 가진 사람
df[filt]

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
3번    송태섭  북산고  168  80  75  70  80  75  Javascript

In [30]:
filt = df['이름'].str.contains('태')    # 이름에 '태'가 들어가는 사람
df[filt]

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
3번    송태섭  북산고  168  80  75  70  80  75  Javascript
4번    서태웅  북산고  187  40  60  70  75  80         NaN
7번    황태산  능남고  188  55  65  45  40  35      PYTHON

In [31]:
df[~filt]      # 이름에 '태'가 들어가지 않는 사람

       이름   학교    키   국어   영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85  Python
2번    정대만  북산고  184   40   35   50  55  25    Java
5번    강백호  북산고  188   15   20   10  35  10     NaN
6번    변덕규  능남고  202   80  100   95  85  80       C
8번    윤대협  능남고  190  100   85   90  95  95      C#

In [32]:
langs = ['Python', 'Java']
filt = df['SW특기'].isin(langs)   # SW 특기가 Python 이거나 Java 인 사람
df[filt]

       이름   학교    키  국어  영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85  Python
2번    정대만  북산고  184  40  35   50  55  25    Java

- 황태산은 PYTHON 이지만 대문자라서 안불러와짐
- 이런 경우엔 아래와 같이 소문자로 만들어서 비교하고 가져오기

In [35]:
langs = ['python', 'java']
filt = df['SW특기'].str.lower().isin(langs)   # .str.lower()을통해 소문자로 변환
df[filt]

       이름   학교    키  국어  영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85  Python
2번    정대만  북산고  184  40  35   50  55  25    Java
7번    황태산  능남고  188  55  65   45  40  35  PYTHON

In [36]:
filt = df['SW특기'].str.contains('Java')    # Java 포함하는 것들 뽑기
df[filt]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [38]:
df['SW특기'].str.contains('Java')

지원번호
1번    False
2번     True
3번     True
4번      NaN
5번      NaN
6번    False
7번    False
8번    False
Name: SW특기, dtype: object

- NaN 데이터 떄문에 이렇게 하면 오류 발생

In [40]:
df['SW특기'].str.contains('Java' , na=False) # NaN 데이터에 대해서 False로 설정(True도 됨)

지원번호
1번    False
2번     True
3번     True
4번    False
5번    False
6번    False
7번    False
8번    False
Name: SW특기, dtype: bool

In [41]:
filt = df['SW특기'].str.contains('Java', na = False)   # Java 포함하는 것들 뽑기
df[filt]

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
2번    정대만  북산고  184  40  35  50  55  25        Java
3번    송태섭  북산고  168  80  75  70  80  75  Javascript

### Cf) pandas 에서 어떤 str 함수를 쓸수 있는지 보는 곳

https://pandas.pydata.org/docs/user_guide/text.html